print('Программа "является ли число числом фибоначчи?"')
n='1'
while n=='1':
    a = int(input('Введите число:'))
    m1 = 0
    m2 = 1
    m = 0
    while a >= m1 or a >= m2:
        if m %2 == 0:
            m1 = m1 + m2
            if a==m1:
                print('Это число фибоначчи')
                break
        if m %2 == 1:
            m2 = m1 + m2
            if a==m2:
                print('Это число фибоначчи')
                break
        m+=1
    if m1>a or m2>a:
        print('Это не число фибоначчи')
    n=input('Запустить программу ещё раз?\n1 - да\nлюбое другая клавиша - выйти из программы\n')
